{
    "config": {
        "layers": [{
            "config": {
                "dtype": "float32",
                "batch_input_shape": [null, 100],
                "sparse": false,
                "name": "input_5"
            },
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "name": "input_5"
        }, {
            "config": {
                "dtype": "float32",
                "batch_input_shape": [null, 2],
                "sparse": false,
                "name": "input_6"
            },
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "name": "input_6"
        }, {
            "config": {
                "layers": [{
                    "config": {
                        "name": "input_date",
                        "batch_input_shape": [null, 2],
                        "sparse": false,
                        "dtype": "float32"
                    },
                    "class_name": "InputLayer",
                    "inbound_nodes": [],
                    "name": "input_date"
                }, {
                    "config": {
                        "name": "input_noise",
                        "batch_input_shape": [null, 100],
                        "sparse": false,
                        "dtype": "float32"
                    },
                    "class_name": "InputLayer",
                    "inbound_nodes": [],
                    "name": "input_noise"
                }, {
                    "config": {
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_initializer": {
                            "config": {
                                "seed": null,
                                "mode": "fan_avg",
                                "scale": 1.0,
                                "distribution": "uniform"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "activation": "selu",
                        "use_bias": true,
                        "kernel_constraint": null,
                        "units": 1,
                        "trainable": true,
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "kernel_regularizer": null,
                        "name": "dense_8"
                    },
                    "class_name": "Dense",
                    "inbound_nodes": [
                        [
                            ["input_date", 0, 0, {}]
                        ]
                    ],
                    "name": "dense_8"
                }, {
                    "config": {
                        "trainable": true,
                        "name": "merge_generator"
                    },
                    "class_name": "Multiply",
                    "inbound_nodes": [
                        [
                            ["input_noise", 0, 0, {}],
                            ["dense_8", 0, 0, {}]
                        ]
                    ],
                    "name": "merge_generator"
                }, {
                    "config": [{
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "dtype": "float32",
                            "batch_input_shape": [null, 100],
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 1024,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "dense_6"
                        },
                        "class_name": "Dense"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 6272,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "dense_7"
                        },
                        "class_name": "Dense"
                    }, {
                        "config": {
                            "target_shape": [128, 7, 7],
                            "trainable": true,
                            "name": "reshape_3"
                        },
                        "class_name": "Reshape"
                    }, {
                        "config": {
                            "size": [2, 2],
                            "name": "up_sampling2d_3",
                            "trainable": true,
                            "data_format": "channels_last"
                        },
                        "class_name": "UpSampling2D"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "normal"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "strides": [1, 1],
                            "kernel_regularizer": null,
                            "kernel_size": [5, 5],
                            "padding": "same",
                            "filters": 256,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_8"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "size": [2, 2],
                            "name": "up_sampling2d_4",
                            "trainable": true,
                            "data_format": "channels_last"
                        },
                        "class_name": "UpSampling2D"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "normal"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "strides": [1, 1],
                            "kernel_regularizer": null,
                            "kernel_size": [5, 5],
                            "padding": "same",
                            "filters": 128,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_9"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "normal"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "tanh",
                            "strides": [1, 1],
                            "kernel_regularizer": null,
                            "kernel_size": [2, 2],
                            "padding": "same",
                            "filters": 1,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_10"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "trainable": true,
                            "name": "flatten_2"
                        },
                        "class_name": "Flatten"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "tanh",
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 1024,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "output_generator"
                        },
                        "class_name": "Dense"
                    }],
                    "class_name": "Sequential",
                    "inbound_nodes": [
                        [
                            ["merge_generator", 0, 0, {}]
                        ]
                    ],
                    "name": "sequential_3"
                }],
                "output_layers": [
                    ["sequential_3", 1, 0]
                ],
                "input_layers": [
                    ["input_noise", 0, 0],
                    ["input_date", 0, 0]
                ],
                "name": "generator"
            },
            "class_name": "Model",
            "inbound_nodes": [
                [
                    ["input_5", 0, 0, {}],
                    ["input_6", 0, 0, {}]
                ]
            ],
            "name": "generator"
        }, {
            "config": {
                "layers": [{
                    "config": {
                        "name": "input_4",
                        "batch_input_shape": [null, 1024],
                        "sparse": false,
                        "dtype": "float32"
                    },
                    "class_name": "InputLayer",
                    "inbound_nodes": [],
                    "name": "input_4"
                }, {
                    "config": [{
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "dtype": "float32",
                            "batch_input_shape": [null, 1024],
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 1024,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "input_discriminator"
                        },
                        "class_name": "Dense"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 288,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "dense_9"
                        },
                        "class_name": "Dense"
                    }, {
                        "config": {
                            "target_shape": [32, 3, 3],
                            "trainable": true,
                            "name": "reshape_4"
                        },
                        "class_name": "Reshape"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "linear",
                            "strides": [2, 2],
                            "kernel_regularizer": null,
                            "kernel_size": [3, 3],
                            "padding": "same",
                            "filters": 32,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_11"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "alpha": 0.20000000298023224,
                            "trainable": true,
                            "name": "leaky_re_lu_6"
                        },
                        "class_name": "LeakyReLU"
                    }, {
                        "config": {
                            "trainable": true,
                            "rate": 0.3,
                            "name": "dropout_5"
                        },
                        "class_name": "Dropout"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "linear",
                            "strides": [1, 1],
                            "kernel_regularizer": null,
                            "kernel_size": [3, 3],
                            "padding": "same",
                            "filters": 64,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_12"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "alpha": 0.20000000298023224,
                            "trainable": true,
                            "name": "leaky_re_lu_7"
                        },
                        "class_name": "LeakyReLU"
                    }, {
                        "config": {
                            "trainable": true,
                            "rate": 0.3,
                            "name": "dropout_6"
                        },
                        "class_name": "Dropout"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "linear",
                            "strides": [2, 2],
                            "kernel_regularizer": null,
                            "kernel_size": [3, 3],
                            "padding": "same",
                            "filters": 128,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_13"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "alpha": 0.20000000298023224,
                            "trainable": true,
                            "name": "leaky_re_lu_8"
                        },
                        "class_name": "LeakyReLU"
                    }, {
                        "config": {
                            "trainable": true,
                            "rate": 0.3,
                            "name": "dropout_7"
                        },
                        "class_name": "Dropout"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "dilation_rate": [1, 1],
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "linear",
                            "strides": [1, 1],
                            "kernel_regularizer": null,
                            "kernel_size": [3, 3],
                            "padding": "same",
                            "filters": 256,
                            "use_bias": true,
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "data_format": "channels_last",
                            "name": "conv2d_14"
                        },
                        "class_name": "Conv2D"
                    }, {
                        "config": {
                            "alpha": 0.20000000298023224,
                            "trainable": true,
                            "name": "leaky_re_lu_9"
                        },
                        "class_name": "LeakyReLU"
                    }, {
                        "config": {
                            "trainable": true,
                            "rate": 0.3,
                            "name": "dropout_8"
                        },
                        "class_name": "Dropout"
                    }, {
                        "config": {
                            "trainable": true,
                            "name": "flatten_3"
                        },
                        "class_name": "Flatten"
                    }, {
                        "config": {
                            "bias_constraint": null,
                            "bias_regularizer": null,
                            "kernel_initializer": {
                                "config": {
                                    "seed": null,
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "distribution": "uniform"
                                },
                                "class_name": "VarianceScaling"
                            },
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_constraint": null,
                            "units": 128,
                            "trainable": true,
                            "bias_initializer": {
                                "config": {},
                                "class_name": "Zeros"
                            },
                            "activity_regularizer": null,
                            "kernel_regularizer": null,
                            "name": "dense_10"
                        },
                        "class_name": "Dense"
                    }, {
                        "config": {
                            "alpha": 0.20000000298023224,
                            "trainable": true,
                            "name": "leaky_re_lu_10"
                        },
                        "class_name": "LeakyReLU"
                    }, {
                        "config": {
                            "trainable": true,
                            "rate": 0.3,
                            "name": "features_discriminator"
                        },
                        "class_name": "Dropout"
                    }],
                    "class_name": "Sequential",
                    "inbound_nodes": [
                        [
                            ["input_4", 0, 0, {}]
                        ]
                    ],
                    "name": "sequential_4"
                }, {
                    "config": {
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_initializer": {
                            "config": {
                                "seed": null,
                                "mode": "fan_avg",
                                "scale": 1.0,
                                "distribution": "uniform"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_constraint": null,
                        "units": 1,
                        "trainable": true,
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "kernel_regularizer": null,
                        "name": "output_fake_discriminator"
                    },
                    "class_name": "Dense",
                    "inbound_nodes": [
                        [
                            ["sequential_4", 1, 0, {}]
                        ]
                    ],
                    "name": "output_fake_discriminator"
                }, {
                    "config": {
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_initializer": {
                            "config": {
                                "seed": null,
                                "mode": "fan_avg",
                                "scale": 1.0,
                                "distribution": "uniform"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_constraint": null,
                        "units": 2,
                        "trainable": true,
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "kernel_regularizer": null,
                        "name": "output_dates_discriminator"
                    },
                    "class_name": "Dense",
                    "inbound_nodes": [
                        [
                            ["sequential_4", 1, 0, {}]
                        ]
                    ],
                    "name": "output_dates_discriminator"
                }],
                "output_layers": [
                    ["output_fake_discriminator", 0, 0],
                    ["output_dates_discriminator", 0, 0]
                ],
                "input_layers": [
                    ["input_4", 0, 0]
                ],
                "name": "discriminator"
            },
            "class_name": "Model",
            "inbound_nodes": [
                [
                    ["generator", 1, 0, {}]
                ]
            ],
            "name": "discriminator"
        }],
        "output_layers": [
            ["discriminator", 1, 0],
            ["discriminator", 1, 1]
        ],
        "input_layers": [
            ["input_5", 0, 0],
            ["input_6", 0, 0]
        ],
        "name": "model_2"
    },
    "class_name": "Model",
    "backend": "tensorflow",
    "keras_version": "2.0.8"
}
